@prefix owlunit: <https://w3id.org/OWLunit/ontology/> . 
@prefix mp: < https://raw.githubusercontent.com/FiorelaCiroku/XD-Testing/main/ontology-network/musical-performance/RecordingProcess/RecordingProcess.owl > .
@prefix td: < https://raw.githubusercontent.com/FiorelaCiroku/XD-Testing/main/ontology-network/musical-performance/RecordingProcess/SPARQLUnitTest/CQTestData/ > .
@prefix mp: < https://raw.githubusercontent.com/FiorelaCiroku/XD-Testing/main/ontology-network/musical-performance/RecordingProcess/SPARQLUnitTest/CQTestCase/ > .
tc:01 a owlunit:CompetencyQuestionVerification ; owlunit:hasCompetencyQuestion "
Which recording is produced by a session?
 "; owlunit:hasSPARQLUnitTest " 
PREFIX mp: <https://raw.githubusercontent.com/FiorelaCiroku/XD-Testing/main/ontology-network/musical-performance/RecordingProcess/RecordingProcess.owl> SELECT DISTINCT ?recording WHERE {?session mp:isSessionOf ?recordingProcess . ?recordingProcess mp:producesRecording ?recording }
 " ; owlunit:hasInputData td:CQDataSet.ttl ; owlunit:hasInputTestDataCategory owlunit:ToyDataset ; owlunit:hasExpectedResult " 
{ "head": { "vars": [ "recording" ] } , "results": { "bindings": [ { "recording": { "type": "uri" , "value": ”https://raw.githubusercontent.com/FiorelaCiroku/XD-Testing/main/ontology-network/musical-performance/RecordingProcess/SPARQLUnitTest/CQDataSet/ComeWithMe" } } ] }
 "; owlunit:testsOntology mp: . 
